docs/notes/emacs/compile.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Comiling Emacs on MacOS</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Comiling Emacs on MacOS</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orged678ea">Git Clone</a></li>
<li><a href="#orgc1011a9">Install Prerequisites</a></li>
<li><a href="#orgcf0ef97">Provide path to libxml headers</a></li>
<li><a href="#orgb159337">Autogen</a></li>
<li><a href="#orgdd01968">Configure</a></li>
<li><a href="#org4a49cd9">Compile</a></li>
<li><a href="#org9c88c32">Add Icon to Dock</a></li>
<li><a href="#org82fdbb7">Verify Features</a></li>
<li><a href="#orga323c1f">Debugging</a></li>
<li><a href="#org2793756">Resources</a></li>
<li><a href="#orgd2c5cb8">ARCHIVED: Native Compilation</a>
<ul>
<li><a href="#orgb0806c4">Notes/Questions</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orged678ea" class="outline-2">
<h2 id="orged678ea"><a href="#orged678ea">Git Clone</a></h2>
<div class="outline-text-2" id="text-orged678ea">
<div class="org-src-container">
<pre class="src src-sh">git clone git://git.sv.gnu.org/emacs.git
<span style="color: #c678dd;">cd</span> emacs
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc1011a9" class="outline-2">
<h2 id="orgc1011a9"><a href="#orgc1011a9">Install Prerequisites</a></h2>
<div class="outline-text-2" id="text-orgc1011a9">
<div class="org-src-container">
<pre class="src src-sh">brew install libxml2
brew install librsvg
brew install imagemagick
brew install jansson
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf0ef97" class="outline-2">
<h2 id="orgcf0ef97"><a href="#orgcf0ef97">Provide path to libxml headers</a></h2>
<div class="outline-text-2" id="text-orgcf0ef97">
<p>
Assuming you have already run <code>brew install libxml2</code> from above:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #dcaeea;">prefix</span>=$(brew --prefix)
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">PKG_CONFIG_PATH</span>=<span style="color: #98be65;">"$prefix/lib/pkgconfig:$prefix/opt/libxml2/lib/pkgconfig"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb159337" class="outline-2">
<h2 id="orgb159337"><a href="#orgb159337">Autogen</a></h2>
<div class="outline-text-2" id="text-orgb159337">
<div class="org-src-container">
<pre class="src src-sh">./autogen.sh
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdd01968" class="outline-2">
<h2 id="orgdd01968"><a href="#orgdd01968">Configure</a></h2>
<div class="outline-text-2" id="text-orgdd01968">
<p>
The <code>configure</code> script provides many options (run <code>./configure --help</code> to see
them all). You can just run <code>./configure</code> and it will choose sensible
defaults, printing out a summary of all the options it used at the end.
</p>

<p>
On MacOS, use the <code>--with-xwidgets</code> in order to use the a built-in browser.
Great for live HTML previewing.
</p>

<p>
If imagemagick is installed, <code>--with-imagemagick</code> allows for some extra
features for displaying images in Emacs.
</p>

<div class="org-src-container">
<pre class="src src-sh">./configure <span style="color: #98be65;">\</span>
 --with-xwidgets <span style="color: #98be65;">\</span>
 --with-imagemagick <span style="color: #98be65;">\</span>
 --without-dbus <span style="color: #98be65;">\</span>
 --with-json
</pre>
</div>
</div>
</div>

<div id="outline-container-org4a49cd9" class="outline-2">
<h2 id="org4a49cd9"><a href="#org4a49cd9">Compile</a></h2>
<div class="outline-text-2" id="text-org4a49cd9">
<p>
Now run <code>make bootstrap</code>. The <code>-j</code> is optional; it allows <code>make</code> to run
recipies in parllel, which speeds things up. This command will take 10-15
minutes.
</p>

<div class="org-src-container">
<pre class="src src-sh">make bootstrap -j
</pre>
</div>

<p>
Question: What is the difference between <code>make bootstrap</code> and <code>make</code>? One
thing: when running <code>make bootstrap</code> I need to have <code>PKG_CONFIG_PATH</code> set, but
when just doing a <code>make</code> I don't. What else?
</p>

<div class="org-src-container">
<pre class="src src-sh">make -j
make install
</pre>
</div>

<p>
After a <code>make install</code>, the executable is located at
<code>./nextstep/Emacs.app/Contents/MacOS/Emacs</code>.
</p>

<p>
MacOS recognizes the directory <code>./nextstep/Emacs.app</code> as an "Application", so
from the Finder, you can just double-click that directory to launch Emacs.
</p>
</div>
</div>

<div id="outline-container-org9c88c32" class="outline-2">
<h2 id="org9c88c32"><a href="#org9c88c32">Add Icon to Dock</a></h2>
<div class="outline-text-2" id="text-org9c88c32">
<p>
Just open Emacs.app (by double-clicking on the <code>./nextstep/Emacs.app/</code>
directory in Finder), and that will put an icon in the dock. Then, pin the
icon in the dock.
</p>
</div>
</div>

<div id="outline-container-org82fdbb7" class="outline-2">
<h2 id="org82fdbb7"><a href="#org82fdbb7">Verify Features</a></h2>
<div class="outline-text-2" id="text-org82fdbb7">
<p>
Once Emacs is running, check whether these features were properly enabled.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>image-type-available-p 'png<span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
t
</pre>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>image-type-available-p 'svg<span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
t
</pre>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>image-type-available-p 'imagemagick<span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
t
</pre>
</div>
</div>

<div id="outline-container-orga323c1f" class="outline-2">
<h2 id="orga323c1f"><a href="#orga323c1f">Debugging</a></h2>
<div class="outline-text-2" id="text-orga323c1f">
<pre class="example" id="org4bdde85">
$ lldb
(lldb) target create "nextstep/Emacs.app/Contents/MacOS/Emacs"
Current executable set to '/Users/chris.clark/Projects/emacs/nextstep/Emacs.app/Contents/MacOS/Emacs' (x86_64).
(lldb) run
</pre>

<p>
To debug problems during running the <code>init.el</code> file, run <code>$EMACS --debug-init</code>.
</p>
</div>
</div>

<div id="outline-container-org2793756" class="outline-2">
<h2 id="org2793756"><a href="#org2793756">Resources</a></h2>
<div class="outline-text-2" id="text-org2793756">
<p>
Emacs for OSX
<a href="https://github.com/caldwell/build-emacs">https://github.com/caldwell/build-emacs</a>
</p>

<p>
Similar to Emacs for OSX, but supports arbitrary git tags
<a href="https://github.com/jimeh/build-emacs-for-macos">https://github.com/jimeh/build-emacs-for-macos</a>
</p>

<p>
Homebrew emacs formula
<a href="https://github.com/Homebrew/homebrew-core/blob/master/Formula/emacs.rb">https://github.com/Homebrew/homebrew-core/blob/master/Formula/emacs.rb</a>
</p>

<p>
Homebrew emacs-plus formula, which has a few more patches
<a href="https://github.com/d12frosted/homebrew-emacs-plus">https://github.com/d12frosted/homebrew-emacs-plus</a>
</p>

<p>
EmacsWiki Building Emacs on MacOS
<a href="https://www.emacswiki.org/emacs?action=browse;oldid=EmacsOnMacOS;id=EmacsForMacOS">https://www.emacswiki.org/emacs?action=browse;oldid=EmacsOnMacOS;id=EmacsForMacOS</a>
</p>
</div>
</div>

<div id="outline-container-orgd2c5cb8" class="outline-2">
<h2 id="orgd2c5cb8"><a href="#orgd2c5cb8">ARCHIVED: Native Compilation</a></h2>
<div class="outline-text-2" id="text-orgd2c5cb8">
<p>
Do things in this section if you want to compile Emacs
<code>--with-native-compilation</code>.
</p>

<blockquote>
<p>
NOTE 1: After a lot of struggle, I got this sort of working, but eventually
gave up on native compilation. Some of the beauty of hacking on interpreted
languages is not having to deal with compilation.
</p>
</blockquote>

<blockquote>
<p>
NOTE 2: Next time, probably best to use: <a href="https://github.com/jimeh/build-emacs-for-macos">https://github.com/jimeh/build-emacs-for-macos</a>
</p>
</blockquote>

<p>
Get libgccjit:
</p>

<div class="org-src-container">
<pre class="src src-sh">brew install libgccjit
</pre>
</div>

<p>
Upgate the homebrew formula for <code>gcc</code> as described here: <a href="https://gist.github.com/AllenDang/f019593e65572a8e0aefc96058a2d23e">https://gist.github.com/AllenDang/f019593e65572a8e0aefc96058a2d23e</a>
</p>

<p>
Then, Install <code>gcc</code> (I've heard <code>clang</code> works as well).
</p>

<div class="org-src-container">
<pre class="src src-sh">brew install gcc --build-from-source --force
</pre>
</div>

<p>
You will now have a program on you <code>$PATH</code> called <code>gcc-11</code>. For some reason
(why?) <code>brew</code> does not link <code>gcc</code> to <code>gcc-11</code>.
</p>

<ul class="org-ul">
<li><p>
Do <b>NOT</b> manually create that link (say, by doing something like <code>ln -s
    /usr/local/bin/gcc-11 /usr/local/bin/gcc</code>). When I tried, it caused the
following error during the <code>./configure</code> step of building Emacs:
</p>

<pre class="example" id="orgda1e660">
checking for AppKit/AppKit.h... no
configure: error: The include files (AppKit/AppKit.h etc) that
are required for a Nextstep build are missing or cannot be compiled.
Either fix this, or re-configure with the option '--without-ns'.
</pre>

<p>
Why does that happen?
</p></li>
</ul>

<p>
Now, we have to tell Emacs which <code>gcc</code> to use and link some extra stuff.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #dcaeea;">gccVersion</span>=$(brew info gcc --json | jq -r <span style="color: #98be65;">'.[].installed[].version'</span>)
<span style="color: #dcaeea;">gccMajorVersion</span>=$(<span style="color: #c678dd;">echo</span> $<span style="color: #dcaeea;">gccVersion</span> | cut -d <span style="color: #98be65;">"."</span> -f 1)
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">CFLAGS</span>=<span style="color: #98be65;">"-I/usr/local/Cellar/gcc/$gccVersion/include"</span>
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">CC</span>=<span style="color: #98be65;">"/usr/local/bin/gcc-$gccMajorVersion"</span>
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">LDFLAGS</span>=<span style="color: #98be65;">"-I/usr/local/Cellar/gcc/$gccVersion/lib/gcc/$gccMajorVersion -I/usr/local/Cellar/gcc/$gccVersion/include"</span>
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">LIBRARY_PATH</span>=<span style="color: #98be65;">"/usr/local/Cellar/gcc/$gccVersion/lib/gcc/$gccMajorVersion"</span>
</pre>
</div>

<p>
Now when running <code>./configure</code> in the next section, add the
<code>--with-native-compilation</code> flag.
</p>

<p>
When opening Emacs, the <code>LIBRARY_PATH</code> env var has to be set <i>inside of
Emacs</i>. That means, start Emacs from the same terminal window where you set
that <code>$LIBRARY_PATH</code> env var, so Emacs inherits it. If, instead, you start
Emacs from a pinned Dock icon, Emacs won't have <code>LIBRARY_PATH</code> set, and you'll
see an error like:
</p>

<pre class="example" id="orge210f43">
ld: library not found for -lgcc_ext.10.5
libgccjit.so: error: error invoking gcc driver
</pre>
</div>

<div id="outline-container-orgb0806c4" class="outline-3">
<h3 id="orgb0806c4"><a href="#orgb0806c4">Notes/Questions</a></h3>
<div class="outline-text-3" id="text-orgb0806c4">
<p>
I think the <code>LIBRARY_PATH</code> env var only needs to be set in Emacs the first
time it starts (?). Try pulling new packages and see if they are properly
compiled when that env var isn't set.
</p>

<p>
Does <code>LIBRARY_PATH</code> need to be set when compiling Emacs, or only when
starting Emacs?
</p>

<p>
Does this stuff have to happen before running the <code>./autogen.sh</code> script?
</p>
</div>
</div>
</div>
</div>
</body>
</html>
